updated notes
